
## Plan Result

[CI link](https://github.com/rindrics-sandbox-org/terraform-operations/actions/runs/11921460761)

It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
20:45:10.694 INFO   The stack at . will be processed in the following order for command init:
Group 1
- Module .


20:45:10.924 STDOUT terraform: Initializing the backend...
20:45:10.949 STDOUT terraform: Initializing modules...
20:45:10.951 STDOUT terraform: Initializing provider plugins...
20:45:10.952 STDOUT terraform: - Reusing previous version of integrations/github from the dependency lock file
20:45:10.990 STDOUT terraform: - Reusing previous version of hashicorp/null from the dependency lock file
20:45:11.016 STDOUT terraform: - Using previously-installed integrations/github v6.3.1
20:45:11.026 STDOUT terraform: - Using previously-installed hashicorp/null v3.2.3
20:45:11.027 STDOUT terraform: Terraform has been successfully initialized!
20:45:11.027 STDOUT terraform: 
20:45:11.027 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
20:45:11.027 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
20:45:11.027 STDOUT terraform: should now work.
20:45:11.027 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
20:45:11.027 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
20:45:11.027 STDOUT terraform: commands will detect it and remind you to do so if necessary.
1063344
57353056
20:45:11.078 INFO   The stack at . will be processed in the following order for command validate:
Group 1
- Module .


20:45:11.518 STDOUT terraform: Success! The configuration is valid.
20:45:11.518 STDOUT terraform: 
20:45:11.568 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module .


20:45:12.274 STDOUT terraform: github_repository.terraform_operations: Preparing import... [id=github-terraform-examples]
20:45:12.274 STDOUT terraform: github_repository.terraform_state_files: Preparing import... [id=terraform-state-files]
20:45:12.274 STDOUT terraform: github_repository.terraform_operations: Refreshing state... [id=github-terraform-examples]
20:45:12.277 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Reading...
20:45:12.277 STDOUT terraform: github_repository.terraform_state_files: Refreshing state... [id=terraform-state-files]
20:45:13.171 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Read complete after 1s [id=14845847]
20:45:13.175 STDOUT terraform: github_membership.org_owner["Rindrics"]: Preparing import... [id=rindrics-sandbox-org:Rindrics]
20:45:13.175 STDOUT terraform: github_membership.org_owner["Rindrics"]: Refreshing state... [id=rindrics-sandbox-org:Rindrics]
20:45:13.449 STDOUT terraform: Terraform used the selected providers to generate the following execution
20:45:13.449 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
20:45:13.449 STDOUT terraform:   + create
20:45:13.449 STDOUT terraform:   ~ update in-place
20:45:13.449 STDOUT terraform: Terraform will perform the following actions:
20:45:13.449 STDOUT terraform:   # github_membership.org_owner["Rindrics"] will be imported
20:45:13.449 STDOUT terraform:     resource "github_membership" "org_owner" {
20:45:13.449 STDOUT terraform:         etag     = "W/\"a2060b3392abb5bf53a7c6295068f43a81f816f4ee082aa3069b5c7182c379da\""
20:45:13.449 STDOUT terraform:         id       = "rindrics-sandbox-org:Rindrics"
20:45:13.450 STDOUT terraform:         role     = "admin"
20:45:13.450 STDOUT terraform:         username = "Rindrics"
20:45:13.450 STDOUT terraform:     }
20:45:13.450 STDOUT terraform:   # github_repository.all_in_one["bar"] will be created
20:45:13.450 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:45:13.450 STDOUT terraform:       + allow_auto_merge            = false
20:45:13.450 STDOUT terraform:       + allow_merge_commit          = true
20:45:13.450 STDOUT terraform:       + allow_rebase_merge          = true
20:45:13.450 STDOUT terraform:       + allow_squash_merge          = true
20:45:13.450 STDOUT terraform:       + archived                    = false
20:45:13.450 STDOUT terraform:       + default_branch              = (known after apply)
20:45:13.450 STDOUT terraform:       + delete_branch_on_merge      = false
20:45:13.450 STDOUT terraform:       + etag                        = (known after apply)
20:45:13.450 STDOUT terraform:       + full_name                   = (known after apply)
20:45:13.450 STDOUT terraform:       + git_clone_url               = (known after apply)
20:45:13.450 STDOUT terraform:       + html_url                    = (known after apply)
20:45:13.450 STDOUT terraform:       + http_clone_url              = (known after apply)
20:45:13.450 STDOUT terraform:       + id                          = (known after apply)
20:45:13.450 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:45:13.450 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:45:13.450 STDOUT terraform:       + name                        = "bar"
20:45:13.450 STDOUT terraform:       + node_id                     = (known after apply)
20:45:13.450 STDOUT terraform:       + primary_language            = (known after apply)
20:45:13.450 STDOUT terraform:       + private                     = (known after apply)
20:45:13.450 STDOUT terraform:       + repo_id                     = (known after apply)
20:45:13.450 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:45:13.450 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:45:13.450 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:45:13.450 STDOUT terraform:       + svn_url                     = (known after apply)
20:45:13.450 STDOUT terraform:       + topics                      = (known after apply)
20:45:13.450 STDOUT terraform:       + visibility                  = "public"
20:45:13.450 STDOUT terraform:       + web_commit_signoff_required = false
20:45:13.450 STDOUT terraform:       + security_and_analysis (known after apply)
20:45:13.450 STDOUT terraform:     }
20:45:13.450 STDOUT terraform:   # github_repository.all_in_one["baz"] will be created
20:45:13.451 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:45:13.451 STDOUT terraform:       + allow_auto_merge            = false
20:45:13.451 STDOUT terraform:       + allow_merge_commit          = true
20:45:13.451 STDOUT terraform:       + allow_rebase_merge          = true
20:45:13.451 STDOUT terraform:       + allow_squash_merge          = true
20:45:13.451 STDOUT terraform:       + archived                    = false
20:45:13.451 STDOUT terraform:       + default_branch              = (known after apply)
20:45:13.451 STDOUT terraform:       + delete_branch_on_merge      = false
20:45:13.451 STDOUT terraform:       + etag                        = (known after apply)
20:45:13.451 STDOUT terraform:       + full_name                   = (known after apply)
20:45:13.451 STDOUT terraform:       + git_clone_url               = (known after apply)
20:45:13.451 STDOUT terraform:       + html_url                    = (known after apply)
20:45:13.451 STDOUT terraform:       + http_clone_url              = (known after apply)
20:45:13.451 STDOUT terraform:       + id                          = (known after apply)
20:45:13.451 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:45:13.451 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:45:13.451 STDOUT terraform:       + name                        = "baz"
20:45:13.451 STDOUT terraform:       + node_id                     = (known after apply)
20:45:13.451 STDOUT terraform:       + primary_language            = (known after apply)
20:45:13.451 STDOUT terraform:       + private                     = (known after apply)
20:45:13.451 STDOUT terraform:       + repo_id                     = (known after apply)
20:45:13.451 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:45:13.451 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:45:13.451 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:45:13.451 STDOUT terraform:       + svn_url                     = (known after apply)
20:45:13.451 STDOUT terraform:       + topics                      = (known after apply)
20:45:13.451 STDOUT terraform:       + visibility                  = "public"
20:45:13.451 STDOUT terraform:       + web_commit_signoff_required = false
20:45:13.451 STDOUT terraform:       + security_and_analysis (known after apply)
20:45:13.451 STDOUT terraform:     }
20:45:13.451 STDOUT terraform:   # github_repository.all_in_one["foo"] will be created
20:45:13.451 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:45:13.451 STDOUT terraform:       + allow_auto_merge            = false
20:45:13.451 STDOUT terraform:       + allow_merge_commit          = true
20:45:13.451 STDOUT terraform:       + allow_rebase_merge          = true
20:45:13.452 STDOUT terraform:       + allow_squash_merge          = true
20:45:13.452 STDOUT terraform:       + archived                    = false
20:45:13.452 STDOUT terraform:       + default_branch              = (known after apply)
20:45:13.452 STDOUT terraform:       + delete_branch_on_merge      = false
20:45:13.452 STDOUT terraform:       + etag                        = (known after apply)
20:45:13.452 STDOUT terraform:       + full_name                   = (known after apply)
20:45:13.452 STDOUT terraform:       + git_clone_url               = (known after apply)
20:45:13.452 STDOUT terraform:       + html_url                    = (known after apply)
20:45:13.452 STDOUT terraform:       + http_clone_url              = (known after apply)
20:45:13.452 STDOUT terraform:       + id                          = (known after apply)
20:45:13.452 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:45:13.452 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:45:13.452 STDOUT terraform:       + name                        = "foo"
20:45:13.452 STDOUT terraform:       + node_id                     = (known after apply)
20:45:13.452 STDOUT terraform:       + primary_language            = (known after apply)
20:45:13.452 STDOUT terraform:       + private                     = (known after apply)
20:45:13.452 STDOUT terraform:       + repo_id                     = (known after apply)
20:45:13.452 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:45:13.452 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:45:13.452 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:45:13.452 STDOUT terraform:       + svn_url                     = (known after apply)
20:45:13.452 STDOUT terraform:       + topics                      = (known after apply)
20:45:13.452 STDOUT terraform:       + visibility                  = "public"
20:45:13.452 STDOUT terraform:       + web_commit_signoff_required = false
20:45:13.452 STDOUT terraform:       + security_and_analysis (known after apply)
20:45:13.452 STDOUT terraform:     }
20:45:13.452 STDOUT terraform:   # github_repository.terraform_operations will be updated in-place
20:45:13.452 STDOUT terraform:   # (imported from "github-terraform-examples")
20:45:13.452 STDOUT terraform:   ~ resource "github_repository" "terraform_operations" {
20:45:13.452 STDOUT terraform:         allow_auto_merge            = false
20:45:13.452 STDOUT terraform:         allow_merge_commit          = true
20:45:13.452 STDOUT terraform:         allow_rebase_merge          = true
20:45:13.452 STDOUT terraform:         allow_squash_merge          = true
20:45:13.452 STDOUT terraform:         allow_update_branch         = false
20:45:13.452 STDOUT terraform:         archived                    = false
20:45:13.452 STDOUT terraform:         auto_init                   = false
20:45:13.453 STDOUT terraform:         default_branch              = "main"
20:45:13.453 STDOUT terraform:         delete_branch_on_merge      = true
20:45:13.453 STDOUT terraform:         description                 = "Organization 配下のリソースを管理する Terraform ソースの置き場所"
20:45:13.453 STDOUT terraform:         etag                        = "W/\"4fa370d2f069c7e9f0f9ea51363a458240fcc7d8571249f9733b57af3d457cf1\""
20:45:13.453 STDOUT terraform:       ~ full_name                   = "rindrics-sandbox-org/terraform-operations" -> (known after apply)
20:45:13.453 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-operations.git"
20:45:13.453 STDOUT terraform:         has_discussions             = false
20:45:13.453 STDOUT terraform:         has_downloads               = false
20:45:13.453 STDOUT terraform:         has_issues                  = true
20:45:13.453 STDOUT terraform:         has_projects                = false
20:45:13.453 STDOUT terraform:         has_wiki                    = false
20:45:13.453 STDOUT terraform:         homepage_url                = null
20:45:13.453 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-operations"
20:45:13.453 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-operations.git"
20:45:13.453 STDOUT terraform:         id                          = "github-terraform-examples"
20:45:13.453 STDOUT terraform:         is_template                 = false
20:45:13.453 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
20:45:13.453 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
20:45:13.453 STDOUT terraform:       ~ name                        = "github-terraform-examples" -> "terraform-operations"
20:45:13.453 STDOUT terraform:         node_id                     = "R_kgDONRuOGQ"
20:45:13.453 STDOUT terraform:         primary_language            = "HCL"
20:45:13.453 STDOUT terraform:         private                     = false
20:45:13.454 STDOUT terraform:         repo_id                     = 890998297
20:45:13.454 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
20:45:13.454 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:45:13.454 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-operations.git"
20:45:13.454 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-operations"
20:45:13.454 STDOUT terraform:         topics                      = []
20:45:13.454 STDOUT terraform:         visibility                  = "public"
20:45:13.454 STDOUT terraform:         vulnerability_alerts        = true
20:45:13.454 STDOUT terraform:         web_commit_signoff_required = false
20:45:13.454 STDOUT terraform:         security_and_analysis {
20:45:13.454 STDOUT terraform:             secret_scanning {
20:45:13.454 STDOUT terraform:                 status = "disabled"
20:45:13.454 STDOUT terraform:             }
20:45:13.454 STDOUT terraform:             secret_scanning_push_protection {
20:45:13.454 STDOUT terraform:                 status = "disabled"
20:45:13.454 STDOUT terraform:             }
20:45:13.455 STDOUT terraform:         }
20:45:13.455 STDOUT terraform:     }
20:45:13.455 STDOUT terraform:   # github_repository.terraform_state_files will be imported
20:45:13.455 STDOUT terraform:     resource "github_repository" "terraform_state_files" {
20:45:13.455 STDOUT terraform:         allow_auto_merge            = false
20:45:13.455 STDOUT terraform:         allow_merge_commit          = true
20:45:13.455 STDOUT terraform:         allow_rebase_merge          = true
20:45:13.455 STDOUT terraform:         allow_squash_merge          = true
20:45:13.455 STDOUT terraform:         allow_update_branch         = false
20:45:13.455 STDOUT terraform:         archived                    = false
20:45:13.455 STDOUT terraform:         auto_init                   = false
20:45:13.455 STDOUT terraform:         default_branch              = "main"
20:45:13.455 STDOUT terraform:         delete_branch_on_merge      = false
20:45:13.455 STDOUT terraform:         description                 = "リポジトリ `github-operations` の GitHub Actions から利用される Terraform state file を保管する"
20:45:13.455 STDOUT terraform:         etag                        = "W/\"4805ada61d6d2694496dc8e3b68c2111c1f16e6db254e6ed8f7f0dd62eaa5379\""
20:45:13.456 STDOUT terraform:         full_name                   = "rindrics-sandbox-org/terraform-state-files"
20:45:13.456 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-state-files.git"
20:45:13.456 STDOUT terraform:         has_discussions             = false
20:45:13.456 STDOUT terraform:         has_downloads               = false
20:45:13.456 STDOUT terraform:         has_issues                  = false
20:45:13.456 STDOUT terraform:         has_projects                = false
20:45:13.456 STDOUT terraform:         has_wiki                    = false
20:45:13.456 STDOUT terraform:         homepage_url                = null
20:45:13.456 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-state-files"
20:45:13.456 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-state-files.git"
20:45:13.456 STDOUT terraform:         id                          = "terraform-state-files"
20:45:13.456 STDOUT terraform:         is_template                 = false
20:45:13.456 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
20:45:13.456 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
20:45:13.456 STDOUT terraform:         name                        = "terraform-state-files"
20:45:13.456 STDOUT terraform:         node_id                     = "R_kgDONRu-jA"
20:45:13.457 STDOUT terraform:         primary_language            = null
20:45:13.457 STDOUT terraform:         private                     = true
20:45:13.457 STDOUT terraform:         repo_id                     = 891010700
20:45:13.457 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
20:45:13.457 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:45:13.457 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-state-files.git"
20:45:13.457 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-state-files"
20:45:13.457 STDOUT terraform:         topics                      = []
20:45:13.457 STDOUT terraform:         visibility                  = "private"
20:45:13.457 STDOUT terraform:         vulnerability_alerts        = true
20:45:13.457 STDOUT terraform:         web_commit_signoff_required = false
20:45:13.457 STDOUT terraform:     }
20:45:13.457 STDOUT terraform:   # github_team.all_in_one["team-1"] will be created
20:45:13.457 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:45:13.457 STDOUT terraform:       + create_default_maintainer = false
20:45:13.457 STDOUT terraform:       + etag                      = (known after apply)
20:45:13.457 STDOUT terraform:       + id                        = (known after apply)
20:45:13.457 STDOUT terraform:       + members_count             = (known after apply)
20:45:13.457 STDOUT terraform:       + name                      = "team-1"
20:45:13.457 STDOUT terraform:       + node_id                   = (known after apply)
20:45:13.457 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:45:13.457 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:45:13.457 STDOUT terraform:       + privacy                   = "closed"
20:45:13.457 STDOUT terraform:       + slug                      = (known after apply)
20:45:13.457 STDOUT terraform:     }
20:45:13.457 STDOUT terraform:   # github_team.all_in_one["team-2"] will be created
20:45:13.457 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:45:13.458 STDOUT terraform:       + create_default_maintainer = false
20:45:13.458 STDOUT terraform:       + etag                      = (known after apply)
20:45:13.458 STDOUT terraform:       + id                        = (known after apply)
20:45:13.458 STDOUT terraform:       + members_count             = (known after apply)
20:45:13.458 STDOUT terraform:       + name                      = "team-2"
20:45:13.458 STDOUT terraform:       + node_id                   = (known after apply)
20:45:13.458 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:45:13.458 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:45:13.458 STDOUT terraform:       + privacy                   = "closed"
20:45:13.458 STDOUT terraform:       + slug                      = (known after apply)
20:45:13.458 STDOUT terraform:     }
20:45:13.458 STDOUT terraform:   # github_team.all_in_one["team-3"] will be created
20:45:13.458 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:45:13.458 STDOUT terraform:       + create_default_maintainer = false
20:45:13.458 STDOUT terraform:       + etag                      = (known after apply)
20:45:13.458 STDOUT terraform:       + id                        = (known after apply)
20:45:13.458 STDOUT terraform:       + members_count             = (known after apply)
20:45:13.458 STDOUT terraform:       + name                      = "team-3"
20:45:13.458 STDOUT terraform:       + node_id                   = (known after apply)
20:45:13.458 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:45:13.458 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:45:13.458 STDOUT terraform:       + privacy                   = "closed"
20:45:13.458 STDOUT terraform:       + slug                      = (known after apply)
20:45:13.458 STDOUT terraform:     }
20:45:13.458 STDOUT terraform:   # github_team.all_in_one["team-4"] will be created
20:45:13.458 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:45:13.458 STDOUT terraform:       + create_default_maintainer = false
20:45:13.458 STDOUT terraform:       + etag                      = (known after apply)
20:45:13.458 STDOUT terraform:       + id                        = (known after apply)
20:45:13.459 STDOUT terraform:       + members_count             = (known after apply)
20:45:13.459 STDOUT terraform:       + name                      = "team-4"
20:45:13.459 STDOUT terraform:       + node_id                   = (known after apply)
20:45:13.459 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:45:13.459 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:45:13.459 STDOUT terraform:       + privacy                   = "closed"
20:45:13.459 STDOUT terraform:       + slug                      = (known after apply)
20:45:13.459 STDOUT terraform:     }
20:45:13.459 STDOUT terraform:   # github_team.all_in_one["team-5"] will be created
20:45:13.459 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:45:13.459 STDOUT terraform:       + create_default_maintainer = false
20:45:13.459 STDOUT terraform:       + etag                      = (known after apply)
20:45:13.459 STDOUT terraform:       + id                        = (known after apply)
20:45:13.459 STDOUT terraform:       + members_count             = (known after apply)
20:45:13.459 STDOUT terraform:       + name                      = "team-5"
20:45:13.459 STDOUT terraform:       + node_id                   = (known after apply)
20:45:13.459 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:45:13.459 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:45:13.459 STDOUT terraform:       + privacy                   = "closed"
20:45:13.459 STDOUT terraform:       + slug                      = (known after apply)
20:45:13.459 STDOUT terraform:     }
20:45:13.459 STDOUT terraform:   # github_team_membership.all_in_one["team-1"] will be created
20:45:13.459 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:45:13.459 STDOUT terraform:       + etag     = (known after apply)
20:45:13.459 STDOUT terraform:       + id       = (known after apply)
20:45:13.459 STDOUT terraform:       + role     = "maintainer"
20:45:13.459 STDOUT terraform:       + team_id  = "team-1"
20:45:13.459 STDOUT terraform:       + username = "Rindrics"
20:45:13.459 STDOUT terraform:     }
20:45:13.459 STDOUT terraform:   # github_team_membership.all_in_one["team-2"] will be created
20:45:13.459 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:45:13.459 STDOUT terraform:       + etag     = (known after apply)
20:45:13.460 STDOUT terraform:       + id       = (known after apply)
20:45:13.460 STDOUT terraform:       + role     = "maintainer"
20:45:13.460 STDOUT terraform:       + team_id  = "team-2"
20:45:13.460 STDOUT terraform:       + username = "Rindrics"
20:45:13.460 STDOUT terraform:     }
20:45:13.460 STDOUT terraform:   # github_team_membership.all_in_one["team-3"] will be created
20:45:13.460 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:45:13.460 STDOUT terraform:       + etag     = (known after apply)
20:45:13.460 STDOUT terraform:       + id       = (known after apply)
20:45:13.460 STDOUT terraform:       + role     = "maintainer"
20:45:13.460 STDOUT terraform:       + team_id  = "team-3"
20:45:13.460 STDOUT terraform:       + username = "Rindrics"
20:45:13.460 STDOUT terraform:     }
20:45:13.460 STDOUT terraform:   # github_team_membership.all_in_one["team-4"] will be created
20:45:13.460 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:45:13.460 STDOUT terraform:       + etag     = (known after apply)
20:45:13.460 STDOUT terraform:       + id       = (known after apply)
20:45:13.460 STDOUT terraform:       + role     = "maintainer"
20:45:13.460 STDOUT terraform:       + team_id  = "team-4"
20:45:13.460 STDOUT terraform:       + username = "Rindrics"
20:45:13.460 STDOUT terraform:     }
20:45:13.460 STDOUT terraform:   # github_team_membership.all_in_one["team-5"] will be created
20:45:13.460 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:45:13.460 STDOUT terraform:       + etag     = (known after apply)
20:45:13.460 STDOUT terraform:       + id       = (known after apply)
20:45:13.460 STDOUT terraform:       + role     = "maintainer"
20:45:13.460 STDOUT terraform:       + team_id  = "team-5"
20:45:13.460 STDOUT terraform:       + username = "Rindrics"
20:45:13.460 STDOUT terraform:     }
20:45:13.460 STDOUT terraform:   # github_team_repository.all_in_one["team-1:foo"] will be created
20:45:13.460 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.460 STDOUT terraform:       + etag       = (known after apply)
20:45:13.460 STDOUT terraform:       + id         = (known after apply)
20:45:13.460 STDOUT terraform:       + permission = "maintain"
20:45:13.460 STDOUT terraform:       + repository = "foo"
20:45:13.460 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.461 STDOUT terraform:     }
20:45:13.461 STDOUT terraform:   # github_team_repository.all_in_one["team-2:baz"] will be created
20:45:13.461 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.461 STDOUT terraform:       + etag       = (known after apply)
20:45:13.461 STDOUT terraform:       + id         = (known after apply)
20:45:13.461 STDOUT terraform:       + permission = "maintain"
20:45:13.461 STDOUT terraform:       + repository = "baz"
20:45:13.461 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.461 STDOUT terraform:     }
20:45:13.461 STDOUT terraform:   # github_team_repository.all_in_one["team-2:foo"] will be created
20:45:13.461 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.461 STDOUT terraform:       + etag       = (known after apply)
20:45:13.461 STDOUT terraform:       + id         = (known after apply)
20:45:13.461 STDOUT terraform:       + permission = "maintain"
20:45:13.461 STDOUT terraform:       + repository = "foo"
20:45:13.461 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.461 STDOUT terraform:     }
20:45:13.461 STDOUT terraform:   # github_team_repository.all_in_one["team-3:bar"] will be created
20:45:13.461 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.461 STDOUT terraform:       + etag       = (known after apply)
20:45:13.461 STDOUT terraform:       + id         = (known after apply)
20:45:13.461 STDOUT terraform:       + permission = "maintain"
20:45:13.461 STDOUT terraform:       + repository = "bar"
20:45:13.461 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.461 STDOUT terraform:     }
20:45:13.461 STDOUT terraform:   # github_team_repository.all_in_one["team-3:baz"] will be created
20:45:13.461 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.461 STDOUT terraform:       + etag       = (known after apply)
20:45:13.461 STDOUT terraform:       + id         = (known after apply)
20:45:13.461 STDOUT terraform:       + permission = "maintain"
20:45:13.461 STDOUT terraform:       + repository = "baz"
20:45:13.461 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.461 STDOUT terraform:     }
20:45:13.461 STDOUT terraform:   # github_team_repository.all_in_one["team-3:foo"] will be created
20:45:13.461 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.462 STDOUT terraform:       + etag       = (known after apply)
20:45:13.462 STDOUT terraform:       + id         = (known after apply)
20:45:13.462 STDOUT terraform:       + permission = "maintain"
20:45:13.462 STDOUT terraform:       + repository = "foo"
20:45:13.462 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.462 STDOUT terraform:     }
20:45:13.462 STDOUT terraform:   # github_team_repository.all_in_one["team-4:baz"] will be created
20:45:13.462 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.462 STDOUT terraform:       + etag       = (known after apply)
20:45:13.462 STDOUT terraform:       + id         = (known after apply)
20:45:13.462 STDOUT terraform:       + permission = "maintain"
20:45:13.462 STDOUT terraform:       + repository = "baz"
20:45:13.462 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.462 STDOUT terraform:     }
20:45:13.462 STDOUT terraform:   # github_team_repository.all_in_one["team-5:bar"] will be created
20:45:13.462 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.462 STDOUT terraform:       + etag       = (known after apply)
20:45:13.462 STDOUT terraform:       + id         = (known after apply)
20:45:13.462 STDOUT terraform:       + permission = "maintain"
20:45:13.462 STDOUT terraform:       + repository = "bar"
20:45:13.462 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.462 STDOUT terraform:     }
20:45:13.462 STDOUT terraform:   # github_team_repository.all_in_one["team-5:baz"] will be created
20:45:13.462 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.462 STDOUT terraform:       + etag       = (known after apply)
20:45:13.462 STDOUT terraform:       + id         = (known after apply)
20:45:13.462 STDOUT terraform:       + permission = "maintain"
20:45:13.462 STDOUT terraform:       + repository = "baz"
20:45:13.462 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.462 STDOUT terraform:     }
20:45:13.462 STDOUT terraform:   # github_team_repository.all_in_one["team-5:foo"] will be created
20:45:13.462 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:45:13.462 STDOUT terraform:       + etag       = (known after apply)
20:45:13.463 STDOUT terraform:       + id         = (known after apply)
20:45:13.463 STDOUT terraform:       + permission = "maintain"
20:45:13.463 STDOUT terraform:       + repository = "foo"
20:45:13.463 STDOUT terraform:       + team_id    = (known after apply)
20:45:13.463 STDOUT terraform:     }
20:45:13.463 STDOUT terraform: Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.
20:45:13.463 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
20:45:13.463 STDOUT terraform: Saved the plan to: .terraform/terraform.plan
20:45:13.463 STDOUT terraform: To perform exactly these actions, run the following command to apply:
20:45:13.463 STDOUT terraform:     terraform apply ".terraform/terraform.plan"

```

</details>

<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":7,"Program":"tfcmt","SHA1":"a36ff5b8b93617eebfa3b798fe026f50a954c3f8","Vars":{},"WorkflowName":"terraform-plan"} -->